src/cf/DataProcessors/уатЗагрузкаДанныхGPS.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>уатЗагрузкаДанныхGPS</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервойСтрокиДанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоЗагрузкаДанныхРегистра</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаДанных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Время</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пробег</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Лат</Name>
							<Comment>Широта пункта назначения</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>21</v8:Digits>
									<v8:FractionDigits>17</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Лон</Name>
							<Comment>Долгота пункта назначения</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>21</v8:Digits>
									<v8:FractionDigits>17</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходТоплива</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пункт</Name>
							<Comment>Представление пункта местоположения</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скорость</Name>
							<Comment>Текущая скорость</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Comment>Транспортное средство</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УровеньТоплива</Name>
							<Comment>Уровень топлива в баке</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПоляФайлаОбмена</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/уатПробегРасходПоМониторингу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатПробегРасходПоМониторингу</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пробег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяРаботыДвигателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасходТоплива</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УровеньТоплива</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеОдометра</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/уатКоординатыПоМониторингу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатКоординатыПоМониторингу</Name>
			<Comment>История местоположения транспортных средств по данным системы спутникового мониторинга (GPS)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Широта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>21</v8:Digits>
							<v8:FractionDigits>17</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Долгота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>21</v8:Digits>
							<v8:FractionDigits>17</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредставлениеАдреса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Скорость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/DataProcessors/уатЗагрузкаДанныхGPS/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Считывает одну строку файла обмена и добавляет позицию номенклатуры в дерево
Процедура ДобавитьСтрокуФайлаВТаблицу(СтрокаОбмена, флОтборТСУстановлен, тблОтборТС, ДопПараметры)
	
	Если ПустаяСтрока(СтрокаОбмена) Тогда
		Возврат;
	КонецЕсли; 
	
	// Формат строки по умолчанию:
	Формат_строки_по_умолчанию = "Дата Время ТС Лат Лон Скорость Пункт Пробег РасходТоплива УровеньТоплива";
		
	// обрезаем кавычки и добавляем справа доп. разделитель
	ОригинальнаяСтрокаОбмена = СтрокаОбмена;
	СтрокаОбмена = СтрокаОбмена + ДопПараметры.Разделитель;//Символы.Таб;
	
	// считаем поля из строки
	списПодстрокиПоля = Новый СписокЗначений; //массив полей, выделенных из строки
	Пока Истина Цикл
		НомРазделителя = Найти(СтрокаОбмена, ДопПараметры.Разделитель); //Символы.Таб);
		Если НомРазделителя = 0 Тогда
			Прервать;
		КонецЕсли;
		ПодстрокаПоле = Лев(СтрокаОбмена, НомРазделителя - 1);
		
		списПодстрокиПоля.Добавить(ПодстрокаПоле);
		СтрокаОбмена = Сред(СтрокаОбмена, НомРазделителя + 1);
	КонецЦикла;
	
	Если списПодстрокиПоля.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Промежуточная структура, необходимая для первоначального заполнения строки без помещения в таблицу данных,
	// для возможности отбора, если он установлен
	ТекСтруктураДанных = Новый Структура("Дата, Время, ТС, ПредставлениеТС, Лат, Лон, Скорость, Пункт, Пробег, РасходТоплива, УровеньТоплива");
	
	НомПоля = 1;
	Для Каждого ТекПодстрока Из списПодстрокиПоля Цикл
		НомПоляНастройка = 1;
		Для Каждого ТекСтрокаПолеНастройка Из ДопПараметры.ПоляФайлаОбмена Цикл //поиск имени поля в таблице настроек
			Если НомПоляНастройка = НомПоля Тогда
				ТекИмяПоля = ТекСтрокаПолеНастройка.Поле;
				Если ТекИмяПоля = "ID в системе мониторинга" Тогда
					ТекСтруктураДанных.ПредставлениеТС = Строка(ТекПодстрока.Значение);
					ТекСтруктураДанных["ТС"] = Справочники.уатТС.НайтиПоРеквизиту("ИДвСистемеНавигации", ТекПодстрока.Значение);
				ИначеЕсли ТекИмяПоля = "Дата" Тогда
					ТекСтруктураДанных[ТекИмяПоля] = Дата(Сред(ТекПодстрока.Значение, 7, 4) + Сред(ТекПодстрока.Значение, 4, 2) + Лев(ТекПодстрока.Значение, 2) + "000000");
				ИначеЕсли ТекИмяПоля = "Время" Тогда
					ТекСтруктураДанных[ТекИмяПоля] = Дата("00010101" + СтрЗаменить(ТекПодстрока.Значение, ":", ""));
				Иначе
					ТекСтруктураДанных[ТекИмяПоля] = Строка(ТекПодстрока.Значение);
				КонецЕсли;
				Прервать;
			КонецЕсли;
			НомПоляНастройка = НомПоляНастройка + 1;
		КонецЦикла;
		
		НомПоля = НомПоля + 1;
	КонецЦикла;
	
	ТекДата = ТекСтруктураДанных.Дата + (ТекСтруктураДанных.Время - '00010101');

	Если ((Не флОтборТСУстановлен) Или тблОтборТС.Найти(ТекСтруктураДанных.ПредставлениеТС, "ИДвСистемеНавигации") <> Неопределено)
		И ТекДата >= ДопПараметры.ДатаНачала И ТекДата <= ДопПараметры.ДатаОкончания Тогда
		НоваяСтрокаДанных = ДопПараметры.ТаблицаДанных.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаДанных, ТекСтруктураДанных);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьКодировкуТекста(КодировкаФайла)
	
	Если КодировкаФайла = "UTF-8" Тогда 
		Возврат КодировкаТекста.UTF8;
	ИначеЕсли КодировкаФайла = "UTF-16" Тогда 
		Возврат КодировкаТекста.UTF16;
	ИначеЕсли КодировкаФайла = "ANSI" Тогда 
		Возврат КодировкаТекста.ANSI;
	ИначеЕсли КодировкаФайла = "OEM" Тогда 
		Возврат КодировкаТекста.OEM;
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // ПолучитьКодировкуТекста()

Процедура ЗагрузитьФайлОбмена(ПараметрыЗапуска, АдресХранилища = Неопределено) Экспорт
	
	ЭтоЗагрузкаДанныхРегистра = ПараметрыЗапуска.Свойство("ЭтоЗагрузкаДанныхРегистра")
		И ПараметрыЗапуска.ЭтоЗагрузкаДанныхРегистра;
	
	ТекстОшибки = "";
	Если ЭтоЗагрузкаДанныхРегистра Тогда
		ЗагрузитьТабличныйФайлОбмена(ПараметрыЗапуска, АдресХранилища, ТекстОшибки);
	Иначе
		ЗагрузитьТекстовыйФайлОбмена(ПараметрыЗапуска, АдресХранилища, ТекстОшибки);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
	
	Если ПараметрыЗапуска.ТаблицаДанных.Количество() = 0 Тогда
		ТекстОшибки = НСтр("ru = 'Не загружены данные из файла. Проверьте настройки загрузки, настройки периода, кодировку и формат файла.'; en = 'Data from the file was not loaded. Check the loading settings, period settings, encoding, and file format.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,"Объект.ТаблицаДанных");
	КонецЕсли;
	
	Попытка
		УдалитьФайлы(ПараметрыЗапуска.ИмяВременногоФайлаОбмена);  // Удаляем временный файл обмена
	Исключение 
	КонецПопытки;
	
	СтруктураДанных = ПреобразоватьТаблицуВМассивДляПередачиНаКлиент(ПараметрыЗапуска.ТаблицаДанных);
	
	Если АдресХранилища <> Неопределено Тогда
		ПоместитьВоВременноеХранилище(Новый Структура("ТекстОшибки, ТаблицаДанных", ТекстОшибки, СтруктураДанных), АдресХранилища);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузитьТекстовыйФайлОбмена(ПараметрыЗапуска, АдресХранилища, ТекстОшибки)
	
	// Считаем файл
	ФайлОбменаОбъект = Новый ЧтениеТекста(ПараметрыЗапуска.ИмяВременногоФайлаОбмена, ПолучитьКодировкуТекста(ПараметрыЗапуска.КодировкаФайла));
	
	Попытка
		ТекстДок = Новый ТекстовыйДокумент;
		ТекстДок.Прочитать(ПараметрыЗапуска.ИмяВременногоФайлаОбмена);
		ВсегоСтрок = ТекстДок.КоличествоСтрок();
	Исключение
		ВсегоСтрок = "?";
	КонецПопытки;
	НомСтроки = 1;
	
	СтрокаФайлаОбмена = "";
	Пока Не СтрокаФайлаОбмена = Неопределено Цикл
		СтрокаФайлаОбмена = ФайлОбменаОбъект.ПрочитатьСтроку();
		
		Если (СтрокаФайлаОбмена <> Неопределено) И (НЕ ПустаяСтрока(СокрЛП(СтрокаФайлаОбмена))) Тогда
			// Для каждой строки файла обмена сформируем строку
			СтрокаФайлаОбмена = СокрЛП(СтрокаФайлаОбмена);
			Попытка			
				ДобавитьСтрокуФайлаВТаблицу(СтрокаФайлаОбмена, ПараметрыЗапуска.флОтборТСУстановлен, ПараметрыЗапуска.тблОтборТС, ПараметрыЗапуска);
			Исключение
				ТекстОшибки = НСтр("en='An error occurred while loading data.';ru='Произошла ошибка при загрузке данных.'");
			КонецПопытки;
		КонецЕсли;
		
		ПроцентВыполнения = (НомСтроки/ВсегоСтрок) * 100;
		ПроцентВыполнения = Окр(ПроцентВыполнения,0);
		ДлительныеОперации.СообщитьПрогресс(, НСтр("en='Loading in progress... ';ru='Идет загрузка данных из файла... '") + ПроцентВыполнения + "%");
		
		НомСтроки = НомСтроки + 1;
	КонецЦикла;
	
	ФайлОбменаОбъект.Закрыть();
	
КонецПроцедуры

Процедура ЗагрузитьТабличныйФайлОбмена(ПараметрыЗапуска, АдресХранилища, ТекстОшибки)
	
	ПустаяДата = '00010101';
	
	Попытка
		ДокументДанных = Новый ТабличныйДокумент;
		ДокументДанных.Прочитать(ПараметрыЗапуска.ИмяВременногоФайлаОбмена, СпособЧтенияЗначенийТабличногоДокумента.Значение);
	Исключение
		ДокументДанных = Неопределено;
		ТекстОшибки = НСтр("en='An error occurred while reading the document.';ru='Ошибка при чтении табличного документа.'");
		Возврат;
	КонецПопытки;
	
	Попытка
		ВсегоСтрок = ДокументДанных.ВысотаТаблицы;
		ВсегоКолонок = ДокументДанных.ШиринаТаблицы;
	Исключение
		ДокументДанных = Неопределено;
		ТекстОшибки = НСтр("en='Error while working with the document.';ru='Ошибка при работе с табличным документом.'");
		Возврат;
	КонецПопытки;
	
	СтруктураШапки = ПолучитьСтруктуруШапки(ПараметрыЗапуска.ИмяТаблицы, ПараметрыЗапуска.СоответствиеЗаголовковФайлов);
	
	НомерСтрокиШапки = Неопределено;
		
	Для НомерСтроки = 1 По ВсегоСтрок Цикл 
		Если Не НомерСтрокиШапки = Неопределено Тогда 
			Прервать;
		КонецЕсли;
		
		Для НомерКолонки = 1 По ВсегоКолонок Цикл 
			ТекущееЗначение = НРег(СокрЛП(ДокументДанных.Область("R" + НомерСтроки + "C" + НомерКолонки).Текст));
			
			НомерУстановлен = Ложь;
			Для Каждого ТекКлюч Из СтруктураШапки Цикл 
				Если ТекКлюч.Значение.НомерКолонки <> 0 Тогда 
					Продолжить;
				КонецЕсли;
				
				Если ТекущееЗначение = ТекКлюч.Значение.ЗаголовокВФайле Тогда 
					ТекКлюч.Значение.НомерКолонки = НомерКолонки;
					НомерСтрокиШапки = НомерСтроки;
					НомерУстановлен = Истина;
				КонецЕсли;
			КонецЦикла;
			
			Если Не НомерУстановлен Тогда 
				Для Каждого ТекКлюч Из СтруктураШапки Цикл 
					Если ТекКлюч.Значение.НомерКолонки <> 0 Тогда 
						Продолжить;
					КонецЕсли;
					
					Если Лев(ТекущееЗначение, СтрДлина(ТекКлюч.Значение.ЗаголовокВФайле)) = ТекКлюч.Значение.ЗаголовокВФайле Тогда 
						ТекКлюч.Значение.НомерКолонки = НомерКолонки;
						НомерСтрокиШапки = НомерСтроки;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если НомерСтрокиШапки = Неопределено Тогда 
		ДокументДанных = Неопределено;
		ТекстОшибки = НСтр("en='Invalid file format';ru='Неверный формат файла'");
		Возврат;
	КонецЕсли;
	
	флНомераКолонокЗаполнены = Ложь;
	Для Каждого ТекКлюч Из СтруктураШапки Цикл 
		Если ЗначениеЗаполнено(ТекКлюч.Значение.НомерКолонки) Тогда 
			флНомераКолонокЗаполнены = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не флНомераКолонокЗаполнены Тогда 
		ДокументДанных = Неопределено;
		ТекстОшибки = НСтр("en='Invalid file format';ru='Неверный формат файла'");
		Возврат;
	КонецЕсли;
	
	ПерваяСтрокаДанных = Макс(ПараметрыЗапуска.НомерПервойСтрокиДанных, НомерСтрокиШапки + 1);
	
	Для НомерСтроки = ПерваяСтрокаДанных По ВсегоСтрок Цикл 
		ПрогрессЗагрузки = Окр((НомерСтроки / ВсегоСтрок) * 100, 0);
		ДлительныеОперации.СообщитьПрогресс(, НСтр("en='Loading in progress... ';ru='Идет загрузка данных из файла... '") + ПрогрессЗагрузки + "%");
		
		НоваяСтрока = ПараметрыЗапуска.ТаблицаДанных.Добавить();
		Для Каждого ТекКлюч Из СтруктураШапки Цикл 
			
			Попытка
				НоваяСтрокаКлюч = ТекКлюч.Ключ;
			Исключение
				НоваяСтрокаКлюч = СтрЗаменить(ТекКлюч.Ключ, "_1", "");
			КонецПопытки;
			
			Если ТекКлюч.Ключ = "Период" Тогда
				ТекТипЯчейки = Тип("Дата");
			ИначеЕсли ТекКлюч.Ключ = "ТС" Тогда
				ТекТипЯчейки = Тип("СправочникСсылка.уатТС");
			ИначеЕсли ТекКлюч.Ключ = "Пункт" Тогда
				ТекТипЯчейки = Тип("Строка");
			Иначе
				ТекТипЯчейки = Тип("Число");
			КонецЕсли;
			
			Если ТекКлюч.Значение.НомерКолонки = 0 Тогда 
				Если ЗначениеЗаполнено(ТекКлюч.Значение.ЗначениеПоУмолчанию) Тогда 
					ТекЗначение = ПолучитьЗначениеЯчейки(
						ТекКлюч.Значение.ЗначениеПоУмолчанию,
						ТекТипЯчейки
					);
				Иначе 
					Продолжить;
				КонецЕсли;
			Иначе
				ТекОбласть = "R" + НомерСтроки + "C" + ТекКлюч.Значение.НомерКолонки;
				ТекОбласть = СтрЗаменить(ТекОбласть,Символы.НПП,"");
				ТекОбласть = СтрЗаменить(ТекОбласть," ","");
				ТекЗначение = ПолучитьЗначениеЯчейки(
					ДокументДанных.Область(ТекОбласть),
					ТекТипЯчейки
				);
			КонецЕсли;
			
			Если НоваяСтрокаКлюч = "Период" Тогда
				НоваяСтрока.Дата = НачалоДня(ТекЗначение);
				НоваяСтрока.Время = ПустаяДата + (ТекЗначение - НачалоДня(ТекЗначение));
			Иначе
				НоваяСтрока[НоваяСтрокаКлюч] = ТекЗначение;
			КонецЕсли;
			
		КонецЦикла;
		
		флПустаяСтрока = Истина;
		Для Каждого ТекКлюч Из СтруктураШапки Цикл
			Попытка
				НоваяСтрокаКлюч = НоваяСтрока[ТекКлюч.Ключ];
			Исключение
				Попытка
					НоваяСтрокаКлюч = НоваяСтрока[СтрЗаменить(ТекКлюч.Ключ, "_1", "")];
				Исключение
				КонецПопытки;
			КонецПопытки;
			
			Если ЗначениеЗаполнено(НоваяСтрокаКлюч) Тогда 
				флПустаяСтрока = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		ТекДата = НоваяСтрока.Дата + (НоваяСтрока.Время - ПустаяДата);
		Если флПустаяСтрока
			Или ПараметрыЗапуска.флОтборТСУстановлен И ПараметрыЗапуска.тблОтборТС.Найти(НоваяСтрока.ТС, "Ссылка") = Неопределено
			Или ТекДата < ПараметрыЗапуска.ДатаНачала
			Или ТекДата > ПараметрыЗапуска.ДатаОкончания Тогда
			ПараметрыЗапуска.ТаблицаДанных.Удалить(НоваяСтрока);
		КонецЕсли;
		
	КонецЦикла;
	
	ДокументДанных = Неопределено;
	
КонецПроцедуры

Функция ПолучитьСтруктуруШапки(Знач ИмяТаблицы, СоответствиеЗаголовковФайлов)
	
	СтруктураШапки = Новый Структура();
	
	Для Каждого ТекСтрока Из СоответствиеЗаголовковФайлов Цикл 
		Если ТекСтрока.ИмяТаблицы = ИмяТаблицы Тогда 
			ДанныеКлюча = Новый Структура();
			ДанныеКлюча.Вставить("НомерКолонки",        0);
			ДанныеКлюча.Вставить("ЗаголовокВФайле",     ТекСтрока.ЗаголовокВФайле);
			ДанныеКлюча.Вставить("ЗначениеПоУмолчанию", ТекСтрока.ЗначениеПоУмолчанию);
			
			Если СтруктураШапки.Свойство(ТекСтрока.ИмяКолонки) Тогда
				СтруктураШапки.Вставить(ТекСтрока.ИмяКолонки + "_1", ДанныеКлюча);
			Иначе
				СтруктураШапки.Вставить(ТекСтрока.ИмяКолонки, ДанныеКлюча);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтруктураШапки;
	
КонецФункции

Функция ПолучитьЗначениеЯчейки(ЯчейкаФайла, ТипЗначения)
		
	Возврат уатОбщегоНазначенияКлиентСервер.ПолучитьЗначениеЯчейкиТабличногоДокумента(ЯчейкаФайла, ТипЗначения);
	
КонецФункции

Функция ПреобразоватьТаблицуВМассивДляПередачиНаКлиент(тбл)
	мсв = Новый Массив;
	
	Для Каждого ТекСтрока Из тбл Цикл
		СтруктураСтроки = Новый Структура();
		Для Каждого ТекКолонка Из тбл.Колонки Цикл
			СтруктураСтроки.Вставить(ТекКолонка.Имя, ТекСтрока[ТекКолонка.Имя]);
		КонецЦикла;
		
		мсв.Добавить(СтруктураСтроки);
	КонецЦикла;
	
	Возврат мсв;
КонецФункции

Процедура ЗагрузкаРегистраМестонахождениеGPS(ПараметрыЗапуска, АдресХранилища = Неопределено) Экспорт
	
	ВсегоСтрок = ПараметрыЗапуска.ТаблицаДанных.Количество();
	НомСтроки = 1;
	МассивОшибокПробегаРасхода = Новый Массив();
	МассивОшибокКоординат = Новый Массив();
	
	ЭтоЗагрузкаДанныхРегистра = ПараметрыЗапуска.Свойство("ЭтоЗагрузкаДанныхРегистра")
		И ПараметрыЗапуска.ЭтоЗагрузкаДанныхРегистра;
	
	КоличествоСтрокСНезаполненнымТС = 0;
	Для Каждого ТекСтрока Из ПараметрыЗапуска.ТаблицаДанных Цикл
		Если Не ЗначениеЗаполнено(ТекСтрока.ТС) Тогда
			КоличествоСтрокСНезаполненнымТС = КоличествоСтрокСНезаполненнымТС + 1;
		КонецЕсли;
	КонецЦикла;
	Если КоличествоСтрокСНезаполненнымТС > 0 Тогда
		ТекстНСтр = НСтр("en = 'Skipped %1 rows with empty vehicle'; ru = 'Пропущено строк с незаполненным ТС: %1'");
		ТекстОшибки = СтрШаблон(ТекстНСтр, КоличествоСтрокСНезаполненнымТС);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		МассивОшибокКоординат.Добавить(ТекстОшибки);
	КонецЕсли;
	
	Если Не ЭтоЗагрузкаДанныхРегистра Тогда
		Для Каждого ТекСтрока Из ПараметрыЗапуска.ТаблицаДанных Цикл
			Если Не ЗначениеЗаполнено(ТекСтрока.ТС) Тогда
				Продолжить;
			КонецЕсли;
			
			ДатаСтроки = ТекСтрока.Дата + (ТекСтрока.Время - '00010101');
			МенеджерЗаписиМестоположениеGPS = РегистрыСведений.уатПробегРасходПоМониторингу.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписиМестоположениеGPS, ТекСтрока);
			МенеджерЗаписиМестоположениеGPS.Период = ДатаСтроки;
			
			Попытка
				МенеджерЗаписиМестоположениеGPS.Записать();
			Исключение
				ТекстНСтр = СформироватьТекстСообщенияОбОшибке(ТекСтрока, Метаданные.РегистрыСведений.уатПробегРасходПоМониторингу.Представление());
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСтр);
				МассивОшибокКоординат.Добавить(ТекстНСтр);
			КонецПопытки;
			
			ПроцентВыполнения = (НомСтроки/ВсегоСтрок) * 100;
			ПроцентВыполнения = Окр(ПроцентВыполнения,0);
			ДлительныеОперации.СообщитьПрогресс(, НСтр("en='Mileage and consumption loading in progress... ';ru='Идет загрузка пробега и расхода... '") + ПроцентВыполнения + "%");
			
			НомСтроки = НомСтроки + 1;
		КонецЦикла;
	КонецЕсли;
	
	НомСтроки = 1;
	Для Каждого ТекСтрока Из ПараметрыЗапуска.ТаблицаДанных Цикл
		Если Не ЗначениеЗаполнено(ТекСтрока.ТС) Тогда
			Продолжить;
		КонецЕсли;
		
		ДатаСтроки = ТекСтрока.Дата + (ТекСтрока.Время - '00010101');
		МенеджерЗаписиКоординатыПоМониторингу = РегистрыСведений.уатКоординатыПоМониторингу.СоздатьМенеджерЗаписи();
		МенеджерЗаписиКоординатыПоМониторингу.Период              = ДатаСтроки;
		МенеджерЗаписиКоординатыПоМониторингу.ТС                  = ТекСтрока.ТС;
		МенеджерЗаписиКоординатыПоМониторингу.Широта              = ТекСтрока.Лат;
		МенеджерЗаписиКоординатыПоМониторингу.Долгота             = ТекСтрока.Лон;
		МенеджерЗаписиКоординатыПоМониторингу.Скорость            = ТекСтрока.Скорость;
		МенеджерЗаписиКоординатыПоМониторингу.ПредставлениеАдреса = ТекСтрока.Пункт;
		МенеджерЗаписиКоординатыПоМониторингу.Курс                = ТекСтрока.Курс;
		
		Попытка
			МенеджерЗаписиКоординатыПоМониторингу.Записать();
		Исключение
			ТекстНСтр = СформироватьТекстСообщенияОбОшибке(ТекСтрока, Метаданные.РегистрыСведений.уатКоординатыПоМониторингу.Представление());
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСтр);
			МассивОшибокКоординат.Добавить(ТекстНСтр);
		КонецПопытки;
		
		ПроцентВыполнения = (НомСтроки/ВсегоСтрок) * 100;
		ПроцентВыполнения = Окр(ПроцентВыполнения,0);
		ДлительныеОперации.СообщитьПрогресс(, НСтр("en='Monitoring coordinates loading in progress... ';ru='Идет загрузка координат по мониторингу... '") + ПроцентВыполнения + "%");
		
		НомСтроки = НомСтроки + 1;
	КонецЦикла;
	
	Если АдресХранилища <> Неопределено Тогда
		ПоместитьВоВременноеХранилище(Новый Структура("МассивОшибокПробегаРасхода, МассивОшибокКоординат",МассивОшибокПробегаРасхода, МассивОшибокКоординат), АдресХранилища);
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьТекстСообщенияОбОшибке(ТекСтрока, ПредставлениеРегистра)
	
	ДатаСтроки = ТекСтрока.Дата + (ТекСтрока.Время - '00010101');
	ТекстНСтр = НСтр("en='Cannot write data for vehicle ""%1"" for time %2 to registry ""%3""';
		|ru='Не удалось записать данные по ТС ""%1"" за период %2 в регистр ""%3""'");
	Результат = СтрШаблон(ТекстНСтр, ТекСтрока.ТС, ДатаСтроки, ПредставлениеРегистра);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
